interface CounselingCenter {
  name: string;
  address: string;
  phone: string;
  lat: number;
  lng: number;
}

// 주석

export const counselingCenters: CounselingCenter[] = [
  {
    name: "엠브레스마인드 심리상담센터 은평직영점",
    address: "서울 은평구 은평로 170 (응암동, 상현빌딩) 301호",
    phone: "02-389-9280",
    lat: 37.6007,
    lng: 126.9161
  },
  {
    name: "엠브레스마인드 성북직영점",
    address: "서울 성북구 종암로 18 (종암동, 거산프라자) 5층",
    phone: "031-873-0714",
    lat: 37.6025,
    lng: 127.0163
  },
  {
    name: "한국종합심리상담교육센터",
    address: "서울 서초구 방배동 981-16 태원빌딩 4층",
    phone: "02-3471-5522",
    lat: 37.4871,
    lng: 126.9995
  },
  {
    name: "혜윰인지심리연구소",
    address: "서울 금천구 시흥동 남서울힐스테이트 아파트 1단지 상가 202호",
    phone: "02-6166-7575",
    lat: 37.4558,
    lng: 126.9003
  },
  {
    name: "헬로스마일",
    address: "서울 서초구 양재동 1-13 프레콘빌딩(양재빌딩) 5층",
    phone: "02-516-5412",
    lat: 37.484,
    lng: 127.0347
  },
  {
    name: "헬로스마일심리연구소 광화문지점",
    address: "서울 종로구 신문로1가 정우빌딩 6층 603호",
    phone: "02-725-5412",
    lat: 37.5704,
    lng: 126.9735
  },
  {
    name: "헬로스마일심리연구소",
    address: "서울 노원구 노해로 75길 14-26 효림빌딩 7층",
    phone: "02-936-5412",
    lat: 37.6543,
    lng: 127.061
  },
  {
    name: "헬로스마일소아청소년전문심리센터",
    address: "서울 강남구 논현1동 39-18 성도빌딩 2층",
    phone: "02-511-6212",
    lat: 37.5112,
    lng: 127.0203
  },
  {
    name: "허그맘 성북지점",
    address: "서울 성북구 종암로 18 (종암동) 거산프라자 5층",
    phone: "02-941-6255",
    lat: 37.6025,
    lng: 127.0163
  },
  {
    name: "허그맘",
    address: "서울특별시 중구 다산로 104 (신당동) 현대빌딩 201호",
    phone: "02-2135-5975",
    lat: 37.5547,
    lng: 127.0109
  },
  {
    name: "해맑은봄심리발달센터",
    address: "서울 마포구 상암동 DMC이안오피스텔 1차 317호",
    phone: "02-304-3030",
    lat: 37.5779,
    lng: 126.8896
  },
  {
    name: "한국아동청소년심리상담센터",
    address: "서울 강남구 선릉로76길 7 (대치동) JH빌딩 4층",
    phone: "02-511-5080",
    lat: 37.5034,
    lng: 127.0486
  },
  {
    name: "한국아동발달심리센터",
    address: "서울 마포구 성산동 56-1 cs제일성모빌딩 7층",
    phone: "02-3143-7769",
    lat: 37.5665,
    lng: 126.9104
  },
  {
    name: "착한벗심리상담센터",
    address: "서울 마포구 월드컵로 190 이안상암2차 706호",
    phone: "02-338-1985",
    lat: 37.5683,
    lng: 126.9002
  },
  {
    name: "㈜몸과마음센터",
    address: "서울 강남구 압구정동 640-9번지 신승빌딩 5층",
    phone: "02-517-3375",
    lat: 37.5262,
    lng: 127.0286
  },
  {
    name: "이음세움심리상담센터",
    address: "서울 서초구 방배동 3001-2 디오슈페리움1차 404호",
    phone: "02-3481-2030",
    lat: 37.4812,
    lng: 126.9823
  },
  {
    name: "유해피심리상담센터",
    address: "서울 양천구 신정동 128-113 현승빌딩 6층",
    phone: "02-2642-3533",
    lat: 37.5204,
    lng: 126.8563
  },
  {
    name: "영호심리상담센터",
    address: "서울 성동구 도선동 69 성동삼성쉐르빌상가 101동 221호",
    phone: "02-2282-7247",
    lat: 37.5611,
    lng: 127.0373
  },
  {
    name: "아이라라심리언어발달센터",
    address: "서울 강서구 화곡로 429 (가양동, 토피아) 302호",
    phone: "02-3665-5255",
    lat: 37.561,
    lng: 126.8353
  },
  {
    name: "심리상담센터헤세드",
    address: "서울 노원구 중계동 591 대호프라자 225호",
    phone: "02-931-1307",
    lat: 37.6456,
    lng: 127.0655
  },
  {
    name: "심리상담센터마이스토리",
    address: "서울 강남구 역삼동 708-32 이에스타워 10층",
    phone: "02-557-1275",
    lat: 37.5013,
    lng: 127.0415
  },
  {
    name: "샘물아동발달연구소",
    address: "서울 중랑구 중랑역로 257 (묵동, 신흥빌딩) 3층",
    phone: "02-976-7778",
    lat: 37.6133,
    lng: 127.077
  },
  {
    name: "토마토아동발달연구소",
    address: "서울 양천구 목동 606-14",
    phone: "02-2649-0236",
    lat: 37.5262,
    lng: 126.8751
  },
  {
    name: "맑은샘심리상담연구소",
    address: "서울 용산구 한강로2가 137-3 3층",
    phone: "02-385-6494",
    lat: 37.5296,
    lng: 126.9677
  },
  {
    name: "마포아동발달센터",
    address: "서울 마포구 대흥동 298 신동빌딩 4층",
    phone: "02-704-7570",
    lat: 37.5465,
    lng: 126.9461
  },
  {
    name: "마이스토리심리상담센터",
    address: "서울 송파구 오금동 18-30 2층",
    phone: "02-404-5412",
    lat: 37.5054,
    lng: 127.127
  },
  {
    name: "마음뜰아동청소년발달센터",
    address: "서울 구로구 경인로 397 (고척동) 골든타워빌딩 701호",
    phone: "070-7551-2347",
    lat: 37.4971,
    lng: 126.8582
  },
  {
    name: "나무그늘발달및심리상담",
    address: "서울 노원구 공릉동 653-5 엘네스트빌 204호",
    phone: "070-8733-4328",
    lat: 37.6234,
    lng: 127.0736
  },
  {
    name: "두잉발달연구소",
    address: "서울 마포구 성산동 592-6 이안상암2차 909호",
    phone: "070-8688-2042",
    lat: 37.5674,
    lng: 126.9008
  },
  {
    name: "헬로스마일상담센터",
    address: "서울 송파구 오금로11길 7 제이타워빌딩 6층",
    phone: "02-413-5412",
    lat: 37.5026,
    lng: 127.1228
  },
  {
    name: "아이맘인지발달연구소",
    address: "서울 광진구 중곡동 610-1 의학신문사 1층 아이맘상담센터",
    phone: "02-3408-5874",
    lat: 37.5619,
    lng: 127.0867
  },
  {
    name: "킹덤심리상담연구소",
    address: "서울 관악구 봉천동 1690-156 2층",
    phone: "02-882-1847",
    lat: 37.4821,
    lng: 126.9411
  },
  {
    name: "한꿈상담심리센터",
    address: "서울 양천구 목동동로 391 (목5동 907-23) 현대파크빌 511호",
    phone: "070-4062-4838",
    lat: 37.5289,
    lng: 126.8747
  },
  {
    name: "허그맘 은평센터",
    address: "서울 은평구 은평로 170 (응암동 96-1) 상현빌딩 301호",
    phone: "02-389-9280",
    lat: 37.6007,
    lng: 126.9161
  },
  {
    name: "허그맘 서초센터",
    address: "서울 서초구 방배로 73 (방배3동 981-15) 양지빌딩 5층",
    phone: "02-522-3688",
    lat: 37.482,
    lng: 126.9867
  },
  {
    name: "허그맘 강동센터",
    address: "서울 강동구 성내동 595번지 코오롱2차아파트상가 2층 201호",
    phone: "02-482-0000",
    lat: 37.5351,
    lng: 127.1235
  },
  {
    name: "은빛심리상담센터",
    address: "서울 강동구 올림픽로 664 (천호동 425-5) 대우한강베네시티 301호",
    phone: "02-487-0620",
    lat: 37.5446,
    lng: 127.137
  },
  {
    name: "허그맘 노원센터",
    address: "서울 노원구 상계동 718 정일빌딩 6층",
    phone: "02-930-0744",
    lat: 37.6559,
    lng: 127.0626
  },
  {
    name: "허그맘아동청소년심리센터",
    address: "서울 강남구 대치동 891-44 노벨과 개미빌딩 2층",
    phone: "02-568-6255",
    lat: 37.4993,
    lng: 127.0555
  }
];

// 39	엠브레스마인드 심리상담센터 은평직영점	02-389-9280	서울 은평구 은평로 170 (응암동, 상현빌딩) 301호
// 38	엠브레스마인드 성북직영점	031-873-0714	서울 성북구 종암로 18 (종암동, 거산프라자) 5층
// 37	한국종합심리상담교육센터	02-3471-5522	서울 서초구 방배동 981-16 태원빌딩 4층
// 36	혜윰인지심리연구소	02-6166-7575	서울 금천구 시흥동 남서울힐스테이트 아파트 1단지 상가 202호
// 35	헬로스마일	02-516-5412	서울 서초구 양재동 1-13 프레콘빌딩(양재빌딩) 5층
// 34	헬로스마일심리연구소 광화문지점	02-725-5412	서울 종로구 신문로1가 정우빌딩 6층 603호
// 33	헬로스마일심리연구소	02-936-5412	서울시 노원구 노해로 75길 14-26 효림빌딩 7층
// 32	헬로스마일소아청소년전문심리센터	02-511-6212	서울 강남구 논현1동 39-18 성도빌딩 2층
// 31	허그맘 성북지점	02-941-6255	서울 성북구 종암로 18 (종암동) 거산프라자 5층
// 30	허그맘	02-2135-5975	서울특별시 중구 다산로 104 (신당동) 현대빌딩 201호
// 29	해맑은봄심리발달센터	02-304-3030	서울 마포구 상암동 DMC이안오피스텔 1차 317호
// 28	한국아동청소년심리상담센터	02-511-5080	서울 강남구 선릉로76길 7 (대치동) JH빌딩 4층
// 27	한국아동발달심리센터	02-3143-7769	서울 마포구 성산동 56-1 cs제일성모빌딩 7층
// 26	착한벗심리상담센터	02-338-1985	서울 마포구 월드컵로 190 이안상암2차 706호
// 25	㈜몸과마음센터	02-517-3375	서울 강남구 압구정동 640-9번지 신승빌딩 5층
// 24	이음세움심리상담센터	02-3481-2030	서울 서초구 방배동 3001-2 디오슈페리움1차 404호
// 23	유해피심리상담센터	02-2642-3533	서울 양천구 신정동 128-113 현승빌딩 6층
// 22	영호심리상담센터	02-2282-7247	서울 성동구 도선동 69 성동삼성쉐르빌상가 101동 221호
// 21	아이라라심리언어발달센터	02-3665-5255	서울 강서구 화곡로 429 (가양동, 토피아) 302호
// 20	심리상담센터헤세드	02-931-1307	서울 노원구 중계동 591 대호프라자 225호
// 19	심리상담센터마이스토리	02-557-1275	서울 강남구 역삼동 708-32 이에스타워 10층
// 18	샘물아동발달연구소	02-976-7778	서울 중랑구 중랑역로 257 (묵동, 신흥빌딩) 3층
// 17	토마토아동발달연구소	02-2649-0236	서울 양천구 목동 606-14
// 16	맑은샘심리상담연구소	02-385-6494	서울 용산구 한강로2가 137-3 3층
// 15	마포아동발달센터	02-704-7570	서울 마포구 대흥동 298 신동빌딩 4층
// 14	마이스토리심리상담센터	02-404-5412	서울 송파구 오금동 18-30 2층
// 13	마음뜰아동청소년발달센터	070-7551-2347	서울 구로구 경인로 397 (고척동) 골든타워빌딩 701호
// 12	나무그늘발달및심리상담	070-8733-4328	서울 노원구 공릉동 653-5 엘네스트빌 204호
// 11	두잉발달연구소	070-8688-2042	서울 마포구 성산동 592-6 이안상암2차 909호
// 10	헬로스마일상담센터	02-413-5412	서울 송파구 오금로11길 7 제이타워빌딩 6층
// 9	아이맘인지발달연구소	02-3408-5874	서울 광진구 중곡동 610-1 의학신문사 1층 아이맘상담센터
// 8	킹덤심리상담연구소	02-882-1847	서울 관악구 봉천동 1690-156 2층
// 7	한꿈상담심리센터	070-4062-4838	서울 양천구 목동동로 391 (목5동 907-23) 현대파크빌 511호
// 6	허그맘 은평센터	02-389-9280	서울 은평구 은평로 170 (응암동 96-1) 상현빌딩 301호
// 5	허그맘 서초센터	02-522-3688	서울 서초구 방배로 73 (방배3동 981-15) 양지빌딩 5층
// 4	허그맘 강동센터	02-482-0000	서울 강동구 성내동 595번지 코오롱2차아파트상가 2층 201호
// 3	은빛심리상담센터	02-487-0620	서울 강동구 올림픽로 664 (천호동 425-5) 대우한강베네시티 301호
// 2	허그맘 노원센터	02-930-0744	서울 노원구 상계동 718 정일빌딩 6층
// 1	허그맘아동청소년심리센터	02-568-6255	서울 강남구 대치동 891-44 노벨과 개미빌딩 2층
